БухЭксп/Catalogs/CW_РасчетыДТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_РасчетыДТ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПроектДТ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ПроектыДТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_СтатусыПроектовДТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Таможня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Таможни</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаможеннаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаможенныйСборРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Всего</Name>
					<Comment>Всего в валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегоРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БрокерскиеУслугиРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НетарифкаРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодТНВЭД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеТовара</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаПроисхождения</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Страны</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДоп</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Риск</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаИТС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопРасходы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТаможеннаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПошлинаРуб</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПошлинаПроцент</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДСРуб</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДСПроцент</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СезСпецПошлинаРуб</Name>
							<Comment>Сезонная специальная пошлина</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АнтидемпинговаяПошлинаРуб</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Comment>Всего в валюте</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоРуб</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НетарифкаРуб</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипНетарифки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ДТГрузоперевозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ДТГрузоперевозок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВсегоРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НетарифкаРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БрокерскиеУслугиРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПошлинаРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СезСпецПошлинаРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АнтидемпинговаяПошлинаРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДСРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПроектДТ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ПроектыДТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасчетДТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_РасчетыДТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_СтатусыПроектовДТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_СтатусыПроектовДТ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПредварительныйРасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвержденныйРасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декларация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_РасчетыДТ/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Параметры.Основание) И Не ЗначениеЗаполнено(Объект.ПроектДТ) Тогда
		ОтказНаКлиенте = Истина;
		Возврат;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Параметры.Основание) И Не ЗначениеЗаполнено(Объект.ПроектДТ) Тогда
		Объект.ПроектДТ = Параметры.Основание;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Параметры.Основание) Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли; 
	
	ВалютаРасчета   = Объект.ПроектДТ.Валюта;
	
	Если ЗначениеЗаполнено(Объект.ПроектДТ.Аналитика) Тогда
		ВариантПривязки = ?(Объект.ПроектДТ.ПроектПоЗаказу,0,1);
	Иначе
		ВариантПривязки = 2;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Дата   = ТекущаяДата();
		Объект.Автор  = ПараметрыСеанса.ТекущийПользователь;
		Объект.Статус = Перечисления.CW_СтатусыПроектовДТ.ПредварительныйРасчет;
		Объект.Наименование = "Расчет";
		ПолучитьКурсВалютыНаСервере();
	КонецЕсли;
	
	КурсДоИзменения = Объект.Курс;
	ДатаДоИзменения = Объект.Дата;
		
	ПраваДоступаНаСервере();
	
	УстановитьДоступНаСервере();
	
	ЗагрузитьСеансовуюНастройку();
	УправлениеЭлементамиФормы();
	СформироватьЗаголовокФормы();
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ОтказНаКлиенте Тогда
		ПоказатьПредупреждение(,"Справочник не предназначен для непосредственного использования!", 5);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//Если Не ЕстьИзменения Тогда
	//	ЕстьИзменения = ЭтаФорма.Модифицированность;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	СохранитьСеансовуюНастройку();
	ПараметрыПередачи = Новый Структура("ЕстьИзмененияДляРаспределения,ЕстьИзмененияВСумме,РасчетСсылка", ЕстьИзмененияДляРаспределения,ЕстьИзмененияВСумме,Объект.Ссылка);
	Оповестить("Документ.ПроектыДТ.Изменение",ПараметрыПередачи,Объект.ПроектДТ);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Справочник.РасчетыДТ.Изменение" Тогда
		
		Если ЗначениеЗаполнено(Параметр.Курс) Тогда
			КурсДоИзменения = Объект.Курс;
			Объект.Курс     = Параметр.Курс;
			Объект.Дата     = Параметр.Дата; 
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Параметр.ТаможенныйСборРуб) Тогда
			Объект.ТаможенныйСборРуб = Параметр.ТаможенныйСборРуб; 
		КонецЕсли;
		
 		Если ЗначениеЗаполнено(Параметр.АдресВоВременномХранилище) Тогда
			ЗагрузитьТоварыИзХранилище(Параметр.АдресВоВременномХранилище);
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТоварыИзХранилище(Адрес)
    
    ТаблицаДанных = ПолучитьИзВременногоХранилища(Адрес);
    Объект.Товары.Загрузить(ТаблицаДанных);
	ОбновитьИтогиПоТоварам();

КонецПроцедуры

#КонецОбласти 

#Область ИнициализацияФормы

&НаСервере
Функция СохранитьСеансовуюНастройку()
	
	_УФС.СохранитьСеансовыеНастройки(ЭтаФорма,,ПФ_НастройкаСписка().СписокКолонок);
	
КонецФункции

&НаСервере
Функция ЗагрузитьСеансовуюНастройку()
	
	Настройка = _УФС.ЗагрузитьСеансовыеНастройки(ЭтаФорма);
	ОбработатьНастройкуСписка(Настройка);
	
КонецФункции

&НаСервере
Функция ПраваДоступаНаСервере()
	
	ПравоРедактирования = CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов");
	Если (НЕ ПравоРедактирования ИЛИ ЭтаФорма.ТолькоПросмотр) Тогда
		
		ЭтаФорма.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	ОбновитьИтогиПоТоварам();
	
	Элементы.ПроектДТАналитика.Заголовок              = ?(ВариантПривязки = 0, "Заказ","Грузоперевозка");
	Элементы.ТоварыЦена.Заголовок                     = "Цена (" + ВалютаРасчета + ")";
	Элементы.ТоварыЦенаИТС.Заголовок                  = "ИТС (" + ВалютаРасчета + ")";
	Элементы.ТоварыСумма.Заголовок                    = "Фактурная стоимость (" + ВалютаРасчета + ")";
	Элементы.ТоварыДопРасходы.Заголовок               = "Доп. расходы (" + ВалютаРасчета + ")";
	Элементы.ТоварыТаможеннаяСтоимость.Заголовок      = "Таможенная стоимость (" + ВалютаРасчета + ")";
	Элементы.ТоварыВсего.Заголовок                    = "Всего (" + ВалютаРасчета + ")";
	Элементы.ТоварыНомерСтроки.ТолькоПросмотр         = ЗапретИзменений;
	Элементы.ТоварыКодТНВЭД.ТолькоПросмотр            = ЗапретИзменений;
	Элементы.ТоварыКодТНВЭДОписание.ТолькоПросмотр    = ЗапретИзменений;
	Элементы.ТоварыНоменклатура.ТолькоПросмотр        = ЗапретИзменений;  
	Элементы.ТоварыСтранаПроисхождения.ТолькоПросмотр = ЗапретИзменений;
	Элементы.ТоварыЕдиницаИзмерения.ТолькоПросмотр    = ЗапретИзменений;
	Элементы.ТоварыКоличество.ТолькоПросмотр          = ЗапретИзменений;
	
	Элементы.ФормаЗагрузитьРасчет_Формат_CTM.Доступность = Не ЗапретИзменений;
	
	Элементы.ПроектДТАналитика.Видимость = Не ВариантПривязки = 2;
		
КонецПроцедуры

&НаСервере
Функция СформироватьЗаголовокФормы()
	
	ЗаголовокДокумента = 
		"Расчет декларации на товары:" 
		+ ?(ЗначениеЗаполнено(Объект.Ссылка), " " + СокрЛП(Объект.Код), " (создание)");
	ЭтаФорма.Заголовок = ЗаголовокДокумента;
	
КонецФункции

&НаСервере
Процедура УстановитьДоступНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РасчетДТ", Объект.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	CW_ДТГрузоперевозок.РасчетДТ
	|ИЗ
	|	РегистрСведений.CW_ДТГрузоперевозок КАК CW_ДТГрузоперевозок
	|ГДЕ
	|	CW_ДТГрузоперевозок.РасчетДТ = &РасчетДТ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗапретИзменений = Выборка.Следующий();
	
КонецПроцедуры
 
#КонецОбласти

#Область РеквизитыФормы

&НаКлиенте
Процедура КурсПриИзменении(Элемент)
	
	Если Не Объект.Курс = КурсДоИзменения И Объект.Товары.Количество() Тогда
		ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаИзмененияКурса", ЭтаФорма);
		ПоказатьВопрос(ПОВ,"Изменился курс расчетов. Пересчитать показатели документа по новому курсу?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли; 
	
	КурсДоИзменения = Объект.Курс;

КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.Дата = ТекущаяДата();
	КонецЕсли;
	
	Если Не Объект.Дата = ДатаДоИзменения Тогда
		ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаИзменениеДаты", ЭтаФорма);
		ПоказатьВопрос(ПОВ,"Изменилась дата документа. Пересчитать курс документа на новую дату?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли; 
	
	ДатаДоИзменения = Объект.Дата;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаИзменениеДаты(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПолучитьКурсВалюты(Неопределено); 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаможенныйСборРубПриИзменении(Элемент)
	ОбновитьИтогиПоТоварам();
	ЕстьИзмененияВСумме = Истина;
КонецПроцедуры

&НаКлиенте
Процедура БрокерскиеУслугиРубПриИзменении(Элемент)
	ЕстьИзмененияВСумме = Истина;
КонецПроцедуры

#КонецОбласти

#Область Товары

&НаСервере
Процедура ОбновитьИтогиПоТоварам()
	
	// итоговая строка по табличной части "Товары" 
	СВ = Строка(ВалютаРасчета);
	ФЧ = "ЧЦ=15; ЧДЦ=2; ЧН=";
	
	Курс = ?(Объект.Курс = 0, 1, Объект.Курс);
	
	ТаможенныйСборВалюта       = Объект.ТаможенныйСборРуб / Курс;
	Объект.ТаможеннаяСтоимость = Объект.Товары.Итог("ТаможеннаяСтоимость");
	Объект.Сумма               = Объект.Товары.Итог("Сумма");
	Объект.Всего               = Объект.Товары.Итог("Всего") + ТаможенныйСборВалюта; 
	Объект.ВсегоРуб            = Объект.Товары.Итог("ВсегоРуб") + Объект.ТаможенныйСборРуб; 
	Объект.НетарифкаРуб        = Объект.Товары.Итог("НетарифкаРуб"); 
	
	Если Объект.Товары.Количество() = 0 Тогда
		ИтогоПоТоварам = "Сведения об услугах отсутствуют";
	Иначе
		ИтогоПоТоварам = "Строк: "+Объект.Товары.Количество() +
						 ";  Фактурная стоимость: "+Формат(Объект.Сумма,ФЧ)+" ("+СВ+")"+ 
						 ";  Всего платежей: "+Формат(Объект.Всего,ФЧ)+" ("+СВ+")"+
						 ";  Всего платежей: "+Формат(Объект.ВсегоРуб,ФЧ)+" (Руб.)"+
						 ";  Нетарифка: "+Формат(Объект.НетарифкаРуб,ФЧ)+" (Руб.)";
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ОбновитьИтогиПоТоварам();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Товары.ТекущаяСтрока;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ТоварыНоменклатураПриИзмененииНаСервере(ТекСтрока);
	ЕстьИзмененияДляРаспределения = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ТоварыНоменклатураПриИзмененииНаСервере(Строка)
	
	ТекСтрока = Объект.Товары.НайтиПоИдентификатору(Строка);

	ТекСтрока.СтранаПроисхождения = ТекСтрока.Номенклатура.СтранаПроисхождения;
	ТекСтрока.ЕдиницаИзмерения    = ТекСтрока.Номенклатура.ЕдиницаИзмерения; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКодТНВЭДПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Товары.ТекущаяСтрока;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 

	ТоварыКодТНВЭДПриИзмененииНаСервере(ТекСтрока);
	ЕстьИзмененияДляРаспределения = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ТоварыКодТНВЭДПриИзмененииНаСервере(Строка)
	
	ТекСтрока = Объект.Товары.НайтиПоИдентификатору(Строка);
		
	ТекСтрока.ОписаниеТовара = ТекСтрока.КодТНВЭД.НаименованиеПолное;
	
	ТоварыНоменклатураПриИзмененииНаСервере(Строка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 

	ПересчитатьСуммыПоСтроке(ТекСтрока);
	ЕстьИзмененияДляРаспределения = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 

	ПересчитатьСуммыПоСтроке(ТекСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 

	ПересчитатьСуммыПоСтроке(ТекСтрока, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДопРасходыПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 

	ПересчитатьСуммыПоСтроке(ТекСтрока);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыТаможеннаяСтоимостьПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 

	ТекСтрока.ЦенаИТС = ТекСтрока.ТаможеннаяСтоимость / ?(ТекСтрока.Количество = 0, 1, ТекСтрока.Количество);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПошлинаПроцентПриИзменении(Элемент)
	
	//ТекСтрока = Элементы.Товары.ТекущиеДанные;
	//
	//Если ТекСтрока = Неопределено Тогда
	//	Возврат;
	//КонецЕсли; 

	//ПересчитатьСуммыПоСтроке(ТекСтрока);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыНДСПроцентПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 

	ПересчитатьСуммыПоСтроке(ТекСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПошлинаРубПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 

	ПересчитатьСуммыПоСтроке(ТекСтрока);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыНДСРубПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 

	ПересчитатьСуммыПоСтроке(ТекСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСезСпецПошлинаРубПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 

	ПересчитатьСуммыПоСтроке(ТекСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыАнтидемпинговаяПошлинаРубПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 

	ПересчитатьСуммыПоСтроке(ТекСтрока);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	
	Отказ = ЗапретИзменений;
	
	Если Не Отказ Тогда
		ЕстьИзмененияДляРаспределения = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = ЗапретИзменений;
	
	Если Не Отказ Тогда
		ЕстьИзмененияДляРаспределения = Истина;
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ТоварыНетарифкаРубПриИзменении(Элемент)
	ЕстьИзмененияВСумме = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВсегоРубПриИзменении(Элемент)
	ЕстьИзмененияВСумме = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВсегоПриИзменении(Элемент)
	ЕстьИзмененияВСумме = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммыПоСтроке(СтрокаТЧ, ОбратныйПересчет = Ложь);
	
	НДСПроцент = CW_Финансы.ПолучитьСтавкуНДС(СтрокаТЧ.НДСПроцент, Ложь);
	Курс = ?(Объект.Курс = 0, 1, Объект.Курс);
	
	Если НЕ ОбратныйПересчет Тогда
		СтрокаТЧ.Сумма = СтрокаТЧ.Цена * СтрокаТЧ.Количество;
	Иначе
		СтрокаТЧ.Цена  = СтрокаТЧ.Сумма / ?(СтрокаТЧ.Количество = 0, 1, СтрокаТЧ.Количество);
	КонецЕсли;
	
	СтрокаТЧ.ТаможеннаяСтоимость = СтрокаТЧ.Сумма + СтрокаТЧ.ДопРасходы;
	СтрокаТЧ.ЦенаИТС             = СтрокаТЧ.ТаможеннаяСтоимость / ?(СтрокаТЧ.Количество = 0, 1, СтрокаТЧ.Количество);
	//СтрокаТЧ.ПошлинаРуб          = СтрокаТЧ.ТаможеннаяСтоимость * СтрокаТЧ.ПошлинаПроцент / 100 * Курс;
	СтрокаТЧ.НДСРуб              = ((СтрокаТЧ.ТаможеннаяСтоимость * Курс) + СтрокаТЧ.ПошлинаРуб) * НДСПроцент / 100; 
	СтрокаТЧ.Всего               = (СтрокаТЧ.ПошлинаРуб + СтрокаТЧ.НДСРуб + СтрокаТЧ.АнтидемпинговаяПошлинаРуб + СтрокаТЧ.СезСпецПошлинаРуб) / Курс;
	СтрокаТЧ.ВсегоРуб            = СтрокаТЧ.ПошлинаРуб + СтрокаТЧ.НДСРуб + СтрокаТЧ.АнтидемпинговаяПошлинаРуб + СтрокаТЧ.СезСпецПошлинаРуб;
	
	ЕстьИзмененияВСумме = Истина;
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура ПолучитьКурсВалюты(Команда)
	
	Если Не ЗначениеЗаполнено(ВалютаРасчета) Тогда
		ПоказатьПредупреждение(,"Не указана валюта расчетов!",5);
		Возврат;
	КонецЕсли; 
	
	ПолучитьКурсВалютыНаСервере();
	
	Если Не Объект.Курс = КурсДоИзменения И Объект.Товары.Количество() Тогда
		ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаИзмененияКурса", ЭтаФорма);
		ПоказатьВопрос(ПОВ,"Изменился курс расчетов. Пересчитать показатели документа по новому курсу?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли; 
	
	КурсДоИзменения = Объект.Курс;
		    	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаИзмененияКурса(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Для каждого Стр Из Объект.Товары Цикл
			ПересчитатьСуммыПоСтроке(Стр);
		КонецЦикла; 
		ОбновитьИтогиПоТоварам();
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура НастройкаСписка(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияНастройкиСпискаТоваров", ЭтаФорма); 
	ОткрытьФорму("ОбщаяФорма.CW_ФормаНастройкиСписка",ПФ_НастройкаСписка(),,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияНастройкиСпискаТоваров(Ответ, ДополнительныеПараметры) Экспорт
	
	Если (Ответ <> Неопределено) Тогда
		ОбработатьНастройкуСписка(Ответ); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьРасчет_Формат_CTM(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ЭтаФорма.Записать();
		СформироватьЗаголовокФормы();
	КонецЕсли; 
	
	Если Объект.Товары.Количество() Тогда
		ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаЗагрузкиТоваров", ЭтаФорма);
		ПоказатьВопрос(ПОВ,"Табличная часть будет очищена, продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		СтруктураПараметров = Новый Структура("Формат, СсылкаНаОбъект", "CTM", Объект.Ссылка);
		ОткрытьФорму("Обработка.CW_ЗагрузкаРасчетовДТИзExcel.Форма.Форма", СтруктураПараметров,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли; 
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаЗагрузкиТоваров(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.Товары.Очистить();
		СтруктураПараметров = Новый Структура("Формат, СсылкаНаОбъект", "CTM", Объект.Ссылка);
		ОткрытьФорму("Обработка.CW_ЗагрузкаРасчетовДТИзExcel.Форма.Форма", СтруктураПараметров,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура ПолучитьКурсВалютыНаСервере()
	
	СтруктураКурсаВзаиморасчетов = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаРасчета, Объект.Дата); // ВызовБП
	
	Объект.Курс = СтруктураКурсаВзаиморасчетов.Курс;

КонецПроцедуры

#КонецОбласти

#Область НастройкаСпискаРасчетов

&НаСервере
Функция ПФ_НастройкаСписка()
	
	ПФ = Новый Структура("Источник,СписокКолонок",ЭтаФорма.Заголовок,Новый Массив);
	
	СформироватьСтруктуруКолонок(Элементы.Товары, ПФ.СписокКолонок);
	СписокКолонок.ЗагрузитьЗначения(ПФ.СписокКолонок);
	
	Возврат(ПФ);
	
КонецФункции

&НаСервере
Процедура СформироватьСтруктуруКолонок(Элемент,МассивСК)
	
	// обходим подчинённые элементы
	Для каждого ПЭ Из Элемент.ПодчиненныеЭлементы Цикл
		
		Узел = ШаблонУзла();
		_сф.ст_ЗаполнитьСвойства(Узел,"Имя,Заголовок,Видимость",ПЭ);
		Узел.ЭтоГруппа = (ТипЗнч(ПЭ) <> Тип("ПолеФормы"));
		МассивСК.Добавить(Узел);
		// --- 
		Если Узел.ЭтоГруппа Тогда
			
			СформироватьСтруктуруКолонок(ПЭ,Узел.Элементы);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Функция ШаблонУзла()
	
	Возврат(Новый Структура("Имя,Заголовок,Видимость,ИзменениеВидимости,ЭтоГруппа,Элементы","","",Ложь,Истина,Ложь,Новый Массив));
	
КонецФункции

&НаСервере
Процедура ОбработатьНастройкуСписка(Настройка)
	
	Если (Настройка = Неопределено) Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Попытка
		
		// необходимо проверить порядок и видимость, 
		// сначала видимость
		Для каждого СК Из Настройка Цикл
			
			ОбновитьВидимость(СК);
			
		КонецЦикла; 
		// потом порядок
		Если (СписокКолонок.Количество()=0) Тогда
			СформироватьСтруктуруКолонок(Элементы.Товары,СписокКолонок);
			ОбновитьПорядок(Настройка);
		Иначе
			ОбновитьПорядок(Настройка);
		КонецЕсли; 
		
	Исключение
		//ОписаниеОшибки()
	КонецПопытки; 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимость(СК)
	
	ЭлементФормы = Элементы.Найти(СК.Имя);
	Если ЭлементФормы <> Неопределено Тогда
		
		ЭлементФормы.Видимость = СК.Видимость;
		Если СК.Видимость И СК.ЭтоГруппа Тогда
			
			Для каждого Элемент Из СК.Элементы Цикл
				
				ОбновитьВидимость(Элемент);
				
			КонецЦикла; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПорядок(Настройка)
	
	ТекущийИндекс = 1;
	Для каждого СК Из Настройка Цикл
		
		ПередвигаемыйЭлемент = Элементы[СК.Имя];
		Элементы.Переместить(ПередвигаемыйЭлемент, ПередвигаемыйЭлемент.Родитель);
		
		Если СК.ЭтоГруппа Тогда
			
			ОбновитьПорядок(СК.Элементы);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	СписокКолонок.ЗагрузитьЗначения(Настройка);
КонецПроцедуры

#КонецОбласти

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти
